results/factorial-final/security-overhead-final-mtls-broker5/security-overhead-final-factorial-mtls-b5-rf5-isr3-msg10240-tps1000-batch131072-acks1-prod12-complz4-trial3/producer-perf-12.log
producer_index=12
producer_count=12
producer_records=8333
producer_throughput=83
[2026-04-20 10:04:12,880] WARN [Producer clientId=perf-producer-client] Bootstrap broker 10.20.1.69:9094 (id: -1 rack: null) disconnected (org.apache.kafka.clients.NetworkClient)
1 records sent, 0.1 records/sec (0.00 MB/sec), 18480.0 ms avg latency, 18480.0 ms max latency.
472 records sent, 91.4 records/sec (0.89 MB/sec), 5711.7 ms avg latency, 6920.0 ms max latency.
1010 records sent, 192.3 records/sec (1.88 MB/sec), 7559.0 ms avg latency, 10276.0 ms max latency.
1337 records sent, 264.5 records/sec (2.58 MB/sec), 5613.8 ms avg latency, 10921.0 ms max latency.
425 records sent, 84.8 records/sec (0.83 MB/sec), 38.9 ms avg latency, 143.0 ms max latency.
419 records sent, 83.6 records/sec (0.82 MB/sec), 24.0 ms avg latency, 77.0 ms max latency.
416 records sent, 83.2 records/sec (0.81 MB/sec), 17.1 ms avg latency, 46.0 ms max latency.
417 records sent, 83.2 records/sec (0.81 MB/sec), 15.0 ms avg latency, 60.0 ms max latency.
416 records sent, 83.0 records/sec (0.81 MB/sec), 14.4 ms avg latency, 45.0 ms max latency.
415 records sent, 82.9 records/sec (0.81 MB/sec), 14.5 ms avg latency, 49.0 ms max latency.
416 records sent, 83.0 records/sec (0.81 MB/sec), 14.5 ms avg latency, 79.0 ms max latency.
416 records sent, 83.2 records/sec (0.81 MB/sec), 14.8 ms avg latency, 54.0 ms max latency.
416 records sent, 83.0 records/sec (0.81 MB/sec), 12.7 ms avg latency, 37.0 ms max latency.
416 records sent, 83.1 records/sec (0.81 MB/sec), 13.0 ms avg latency, 42.0 ms max latency.
416 records sent, 83.2 records/sec (0.81 MB/sec), 13.2 ms avg latency, 48.0 ms max latency.
415 records sent, 82.8 records/sec (0.81 MB/sec), 13.0 ms avg latency, 45.0 ms max latency.
416 records sent, 83.0 records/sec (0.81 MB/sec), 13.0 ms avg latency, 39.0 ms max latency.
8333 records sent, 82.979825 records/sec (0.81 MB/sec), 2153.68 ms avg latency, 18480.00 ms max latency, 19 ms 50th, 8932 ms 95th, 10364 ms 99th, 10916 ms 99.9th.